In [3]:
import numpy as np
import pandas as pd

In [3]:
dictionary = {'First Name':['Liu','Cai'],'Second Name':['Rui','Zhirong'],'Age':[18,19],'School':['CQUPT','CQU']}

In [4]:
dictionary

{'First Name': ['Liu', 'Cai'],
 'Second Name': ['Rui', 'Zhirong'],
 'Age': [18, 19],
 'School': ['CQUPT', 'CQU']}

In [13]:
DataF = pd.DataFrame(dictionary)
DataF

  First Name Second Name  Age School
0        Liu         Rui   18  CQUPT
1        Cai     Zhirong   19    CQU

In [10]:
DataF.head()  #如果DataF有很多行，那么只显示前五行的内容

  First Name Second Name  Age School
0        Liu         Rui   18  CQUPT
1        Cai     Zhirong   19    CQU

In [11]:
pd.DataFrame(DataF,columns=['Second Name','Age','Grade']) #按照指定顺序排列，如果有不存在的，就显示NaN

  Second Name  Age  Grade
0         Rui   18    NaN
1     Zhirong   19    NaN

In [14]:
DataF.columns #返回所有索引

Index(['First Name', 'Second Name', 'Age', 'School'], dtype='object')

In [15]:
DataF['Age']#检索为Series

0    18
1    19
Name: Age, dtype: int64

In [22]:
DataF.School #同上，但是这种方法不能创建新列！

0    CQUPT
1      CQU
Name: School, dtype: object

In [24]:
DataF['National'] = 'China' #空列赋值
DataF

  First Name Second Name  Age School National
0        Liu         Rui   18  CQUPT    China
1        Cai     Zhirong   19    CQU    China

In [26]:
DataF.loc[0] #读取行的位置

First Name       Liu
Second Name      Rui
Age               18
School         CQUPT
National       China
Name: 0, dtype: object

In [32]:
#通过列表或者数组赋值一个列
lisT = ['what','is']
DataF['deb']= lisT
DataF

  First Name Second Name  Age School National   deb
0        Liu         Rui   18  CQUPT    China  what
1        Cai     Zhirong   19    CQU    China    is

In [51]:
#如果是通过Series，就不需要长度匹配, 缺少的项会用NaN表示
S = pd.Series(['hehe'],index=[1])
DataF['len2'] = S
DataF

  First Name Second Name  Age School National   deb  len2
0        Liu         Rui   18  CQUPT    China  what   NaN
1        Cai     Zhirong   19    CQU    China    is  hehe

In [55]:
#删除列
del DataF['deb']
DataF

  First Name Second Name  Age School National  len2
0        Liu         Rui   18  CQUPT    China   NaN
1        Cai     Zhirong   19    CQU    China  hehe

In [66]:
#转置
DataF.T

                 0        1
First Name     Liu      Cai
Second Name    Rui  Zhirong
Age             18       19
School       CQUPT      CQU
National     China    China
len2           NaN     hehe

<img src="picture.jpg" width="40%">

# DataFrame构造函数的有效输入<img src="1.png" width="60%">

In [8]:
#利用numpy矩阵创建DataFrame
arrnp = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
dataff = pd.DataFrame(arrnp)
dataff

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [9]:
dataff.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
#索引是否存在？
3 in dataff.index

True

# DataFrame索引的一些有用的方法 <img src="2.png" width="60%">